simplebalance89-ai/casa-companion-mobile/Casa Companion/voice-agent/firmware/sdkconfig.defaults
# Casa Companion Voice Agent — ESP32-S3 defaults
# These values are applied on the first build; override via menuconfig or sdkconfig.

CONFIG_IDF_TARGET="esp32s3"

# CPU / PSRAM
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Bluetooth
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Network
CONFIG_LWIP_MAX_SOCKETS=16

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Power management
CONFIG_PM_ENABLE=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
